# COMPLETE PANDAS FOR DATA SCIENCE : (VENV)

In [3]:
import numpy as np  
import pandas as pd
import openpyxl as opy

print(np.__version__)
print(pd.__version__)
print(opy.__version__)

# Importing modeules of numpy and pandas !

2.2.4
2.2.3
3.1.5

In [ ]:
# DATA UNDERSTANDING : VIA READING DATA 
# We may read data by two methods .

# 1 Way : Read existing data in csv file , excel fie , json data sql file etc.
# 2 Way : Create a file of data then read it

# lets see first way.

# Note : Be super comfortable with syntax to read file especilllay reading existing files , be aware about system  and syntax of difereenet different file extension(csv ,excel, json and sql etc.) how the works and used.
# Note : Intially Things might be challenging and complex but just stick to it and keep practicing every thing willl be sorted.
# Note: Get aware about how and when encoding and of which encoding is required .
# Note : Be aware out all modules required(if required) to make read a file of some specific file . e.g to read xlsx file we required xlrd module , khair abhi to install kr liya hai.
# Get comfortable about ecosystem of dataframes and how they works in pandas and be ready with what is requires.

# By the way encoding invoke is required for .json and .csv only and it is latin1 and no module intallation is required for them , for .xlsx no invoking of encoding is required but the module intsallation of xlrd is neccessary.




# Note : For specific extension type we need to invoke  that specific encoding practice only one time after that it willl get invoke by its own for that extension type.
# FOR .CSV AND .JSON  eccoding practices is latin1. and  no modeule installation.
# FOR .xlsx no encoding is required but module of xlrd is required to install.
# dont forget to put that starting   r

## Understanding/Overview of file handling.

###  Reading existing file.
#### Supppoted format in Pandas : CSV , EXCEL , JSON , SQL etc.

In [ ]:
# FOR READING EXISTING DATA OF FILE PANDAS PROVIDERS US VARIOUS READING (FUNCTIONS/METHODS) TO MAKE IT LOAD INTO PANDAS DATAFRAMES.

# FOR .csv  : pd.read_csv(file_name)
# FOR .json : pd.read_json(file_name)
# FOR .xlsx : pd.read_excel(file_name)

In [ ]:
# READ DATA FROM JSON FILE INTO DATA FRAMES.


df = pd.read_json(r"C:\Users\Pankaj Yadav\Downloads\products.json",encoding = 'latin1')  # encoding character needs to invoke only one time 
print(df)


# Two Types of Encoding.

#1 = encoding = "utf-8"
#2 = encoding = "latin1"
# Implement those which suits the extension type.

   ProductID ProductName     Category  Price
0          1      Laptop  Electronics   1000
1          2       Chair    Furniture    150
2          3        Book   Stationery     20

In [ ]:
# One more example:

# READ EXISTING DATA FROM JSON FILE INTO DATA FRAMES.

df = pd.read_json(r"C:\Users\Pankaj Yadav\Downloads\sample_Data.json")
print(df)

    id                                               name  \
0    1                                    Apple iPhone 12
1    2                                 Samsung Galaxy S21
2    3                                 Sony PlayStation 5
3    4                  LG OLED55CXPUA 55-inch 4K OLED TV
4    5        Bose QuietComfort 35 II Wireless Headphones
5    6                          Fitbit Versa 3 Smartwatch
6    7                             KitchenAid Stand Mixer
7    8                 Dyson V11 Absolute Cordless Vacuum
8    9                         Ninja Foodi Smart XL Grill
9   10                    Canon EOS Rebel T8i DSLR Camera
10  11                                  Apple AirPods Pro
11  12        Bose QuietComfort 35 II Wireless Headphones
12  13                    Fitbit Charge 4 Fitness Tracker
13  14                              Samsung Galaxy Watch3
14  15  Sony WH-1000XM4 Wireless Noise-Cancelling Head...
15  16          Breville Barista Express Espresso Machine
16  17                        Keurig K-Elite Coffee Maker
17  18                     iRobot Roomba i7+ Robot Vacuum
18  19                   Ninja Foodi Digital Air Fry Oven
19  20                   Cuisinart ICE-70 Ice Cream Maker

                                          description    price  \
0   The Apple iPhone 12 features a 6.1-inch Super ...   999.00
1   The Samsung Galaxy S21 features a 6.2-inch Dyn...   799.00
2   The Sony PlayStation 5 features an AMD Zen 2-b...   499.99
3   The LG OLED55CXPUA 55-inch 4K OLED TV features...  1599.99
4   The Bose QuietComfort 35 II Wireless Headphone...   299.00
5   The Fitbit Versa 3 Smartwatch features a built...   229.95
6   The KitchenAid Stand Mixer features a 5-quart ...   399.99
7   The Dyson V11 Absolute Cordless Vacuum feature...   699.99
8   The Ninja Foodi Smart XL Grill features 6-in-1...   279.99
9   The Canon EOS Rebel T8i DSLR Camera features a...   899.00
10  The Apple AirPods Pro feature active noise can...   249.00
11  The Bose QuietComfort 35 II Wireless Headphone...   299.00
12  The Fitbit Charge 4 Fitness Tracker features G...   129.95
13  The Samsung Galaxy Watch3 features a rotating ...   399.99
14  The Sony WH-1000XM4 Wireless Noise-Cancelling ...   349.99
15  The Breville Barista Express Espresso Machine ...   699.95
16  The Keurig K-Elite Coffee Maker features a str...   169.99
17  The iRobot Roomba i7+ Robot Vacuum features au...   799.99
18  The Ninja Foodi Digital Air Fry Oven features ...   209.99
19  The Cuisinart ICE-70 Ice Cream Maker features ...   139.99

           category                                              image
0       Electronics  https://www.apple.com/newsroom/images/product/...
1       Electronics  https://images.samsung.com/is/image/samsung/p6...
2       Electronics  https://www.sony.com/image/44baa604124b770c824...
3       Electronics  https://www.lg.com/us/images/tvs/md07501804/ga...
4       Electronics  https://assets.bose.com/content/dam/Bose_DAM/W...
5       Electronics  https://www.fitbit.com/global/content/dam/fitb...
6    Home & Kitchen  https://www.kitchenaid.com/content/dam/global/...
7   Home Appliances  https://www.dysoncanada.ca/dam/dyson/images/pr...
8    Home & Kitchen  https://www.ninjakitchen.com/medias/Ninja-OP50...
9       Electronics  https://www.canon.com.au/-/media/images/produc...
10      Electronics  https://www.apple.com/v/airpods-pro/b/images/m...
11      Electronics  https://assets.bose.com/content/dam/Bose_DAM/W...
12      Electronics  https://www.fitbit.com/global/content/dam/fitb...
13      Electronics  https://images.samsung.com/is/image/samsung/as...
14      Electronics  https://www.sony.com/image/1cdd6354c4cd21cc4f7...
15   Home & Kitchen  https://www.breville.com/content/dam/breville/...
16   Home & Kitchen  https://www.keurig.com/content/dam/global-ecom...
17   Home & Kitchen  https://store.irobot.com/default/i7-vacuuming-...
18   Home & Kitchen  https://www.ninjakitchen.com/static/img/produc...
19   Home & Kitchen  https://www.cuisinart.com/share/images/product...

In [ ]:
# READ EXISTING DATA OF FILE OF CSV INTO DATA FRAMES:

df = pd.read_csv(r"C:\Users\Pankaj Yadav\Downloads\sales_data_sample.csv", encoding = "latin1")
print(df)

      ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER    SALES  \
0           10107               30      95.70                2  2871.00
1           10121               34      81.35                5  2765.90
2           10134               41      94.74                2  3884.34
3           10145               45      83.26                6  3746.70
4           10159               49     100.00               14  5205.27
...           ...              ...        ...              ...      ...
2818        10350               20     100.00               15  2244.40
2819        10373               29     100.00                1  3978.51
2820        10386               43     100.00                4  5417.57
2821        10397               34      62.24                1  2116.16
2822        10414               47      65.52                9  3079.44

            ORDERDATE    STATUS  QTR_ID  MONTH_ID  YEAR_ID  ...  \
0      2/24/2003 0:00   Shipped       1         2     2003  ...
1       5/7/2003 0:00   Shipped       2         5     2003  ...
2       7/1/2003 0:00   Shipped       3         7     2003  ...
3      8/25/2003 0:00   Shipped       3         8     2003  ...
4     10/10/2003 0:00   Shipped       4        10     2003  ...
...               ...       ...     ...       ...      ...  ...
2818   12/2/2004 0:00   Shipped       4        12     2004  ...
2819   1/31/2005 0:00   Shipped       1         1     2005  ...
2820    3/1/2005 0:00  Resolved       1         3     2005  ...
2821   3/28/2005 0:00   Shipped       1         3     2005  ...
2822    5/6/2005 0:00   On Hold       2         5     2005  ...

                       ADDRESSLINE1  ADDRESSLINE2           CITY STATE  \
0           897 Long Airport Avenue           NaN            NYC    NY
1                59 rue de l'Abbaye           NaN          Reims   NaN
2     27 rue du Colonel Pierre Avia           NaN          Paris   NaN
3                78934 Hillside Dr.           NaN       Pasadena    CA
4                   7734 Strong St.           NaN  San Francisco    CA
...                             ...           ...            ...   ...
2818             C/ Moralzarzal, 86           NaN         Madrid   NaN
2819                    Torikatu 38           NaN           Oulu   NaN
2820             C/ Moralzarzal, 86           NaN         Madrid   NaN
2821          1 rue Alsace-Lorraine           NaN       Toulouse   NaN
2822             8616 Spinnaker Dr.           NaN         Boston    MA

     POSTALCODE  COUNTRY TERRITORY CONTACTLASTNAME CONTACTFIRSTNAME DEALSIZE
0         10022      USA       NaN              Yu             Kwai    Small
1         51100   France      EMEA         Henriot             Paul    Small
2         75508   France      EMEA        Da Cunha           Daniel   Medium
3         90003      USA       NaN           Young            Julie   Medium
4           NaN      USA       NaN           Brown            Julie   Medium
...         ...      ...       ...             ...              ...      ...
2818      28034    Spain      EMEA          Freyre            Diego    Small
2819      90110  Finland      EMEA       Koskitalo           Pirkko   Medium
2820      28034    Spain      EMEA          Freyre            Diego   Medium
2821      31000   France      EMEA          Roulet          Annette    Small
2822      51003      USA       NaN         Yoshido             Juri   Medium

[2823 rows x 25 columns]

In [19]:
# READ EXISTING DATA OF FILE OF EXCEL INTO DATA FRAMES:

df = pd.read_excel(r"C:\Users\Pankaj Yadav\Downloads\SampleSuperstore.xlsx")
print(df)

      Row ID        Order ID Order Date  Ship Date       Ship Mode  \
0          1  CA-2016-152156 2016-11-08 2016-11-11    Second Class
1          2  CA-2016-152156 2016-11-08 2016-11-11    Second Class
2          3  CA-2016-138688 2016-06-12 2016-06-16    Second Class
3          4  US-2015-108966 2015-10-11 2015-10-18  Standard Class
4          5  US-2015-108966 2015-10-11 2015-10-18  Standard Class
...      ...             ...        ...        ...             ...
9989    9990  CA-2014-110422 2014-01-21 2014-01-23    Second Class
9990    9991  CA-2017-121258 2017-02-26 2017-03-03  Standard Class
9991    9992  CA-2017-121258 2017-02-26 2017-03-03  Standard Class
9992    9993  CA-2017-121258 2017-02-26 2017-03-03  Standard Class
9993    9994  CA-2017-119914 2017-05-04 2017-05-09    Second Class

     Customer ID     Customer Name    Segment        Country             City  \
0       CG-12520       Claire Gute   Consumer  United States        Henderson
1       CG-12520       Claire Gute   Consumer  United States        Henderson
2       DV-13045   Darrin Van Huff  Corporate  United States      Los Angeles
3       SO-20335    Sean O'Donnell   Consumer  United States  Fort Lauderdale
4       SO-20335    Sean O'Donnell   Consumer  United States  Fort Lauderdale
...          ...               ...        ...            ...              ...
9989    TB-21400  Tom Boeckenhauer   Consumer  United States            Miami
9990    DB-13060       Dave Brooks   Consumer  United States       Costa Mesa
9991    DB-13060       Dave Brooks   Consumer  United States       Costa Mesa
9992    DB-13060       Dave Brooks   Consumer  United States       Costa Mesa
9993    CC-12220      Chris Cortes   Consumer  United States      Westminster

      ... Postal Code  Region       Product ID         Category Sub-Category  \
0     ...       42420   South  FUR-BO-10001798        Furniture    Bookcases
1     ...       42420   South  FUR-CH-10000454        Furniture       Chairs
2     ...       90036    West  OFF-LA-10000240  Office Supplies       Labels
3     ...       33311   South  FUR-TA-10000577        Furniture       Tables
4     ...       33311   South  OFF-ST-10000760  Office Supplies      Storage
...   ...         ...     ...              ...              ...          ...
9989  ...       33180   South  FUR-FU-10001889        Furniture  Furnishings
9990  ...       92627    West  FUR-FU-10000747        Furniture  Furnishings
9991  ...       92627    West  TEC-PH-10003645       Technology       Phones
9992  ...       92627    West  OFF-PA-10004041  Office Supplies        Paper
9993  ...       92683    West  OFF-AP-10002684  Office Supplies   Appliances

                                           Product Name     Sales  Quantity  \
0                     Bush Somerset Collection Bookcase  261.9600         2
1     Hon Deluxe Fabric Upholstered Stacking Chairs,...  731.9400         3
2     Self-Adhesive Address Labels for Typewriters b...   14.6200         2
3         Bretford CR4500 Series Slim Rectangular Table  957.5775         5
4                        Eldon Fold 'N Roll Cart System   22.3680         2
...                                                 ...       ...       ...
9989                             Ultra Door Pull Handle   25.2480         3
9990  Tenex B1-RE Series Chair Mats for Low Pile Car...   91.9600         2
9991                              Aastra 57i VoIP phone  258.5760         2
9992  It's Hot Message Books with Stickers, 2 3/4" x 5"   29.6000         4
9993  Acco 7-Outlet Masterpiece Power Center, Wihtou...  243.1600         2

      Discount    Profit
0         0.00   41.9136
1         0.00  219.5820
2         0.00    6.8714
3         0.45 -383.0310
4         0.20    2.5164
...        ...       ...
9989      0.20    4.1028
9990      0.00   15.6332
9991      0.20   19.3932
9992      0.00   13.3200
9993      0.00   72.9480

[9994 rows x 21 columns]

In [ ]:
# ALSO EXPLORE ABOUT HOW TO READ ACCCES DATA OF SPECIFIC EXTENSION IF IT  EXIST ON ANY CLOUD PLATFORNM .  Explore about gcsfs.

### Creating/Saving and the Reading the file.

In [ ]:
# lets create a file first:

data = {
    "Name" : ["Ram","Shyam","Ghanshyam"],
    "City" : ["A","B","C"],
    "Age"  : [12,34,56]
}

df = pd.DataFrame(data)
print(df)

        Name City  Age
0        Ram    A   12
1      Shyam    B   34
2  Ghanshyam    C   56

In [12]:
# Saving that created file:

# To save in csv : Use  df.to_csv("savedfile.csv")  here savedfile.csv will be name of saved file in csv remember .csv extension is imp to specify so that it stores in csv format.
# To save in json : Use  df.to_json("output.json")  here same rule also applies
# To save in excel : Use  df.to_excel("output.xlsx")  here also.

# Remember that to_csv, to_excel , to_json are prebuilt methods
# Here df is name of created dataframe.
# If you wish not to print that idx no 0,1,2,3,4, .. into saved filed simply passs index = False along sied of savedfile name. see now


data = {
    
    "Name" : ["Ram","Shyam","Ghanshyam"],
    "City" : ["A","B","C"],
    "Age"  : [12,34,56]

}

df = pd.DataFrame(data)

print(df)

df.to_csv("savedfile.csv", index = False)  # see in file due to using index = False it deletes idx nos.

df.to_json("savedfilejson.json")  
 
df.to_excel("file_excel.xlsx", index = False)   # To show it in this excel format we required openpyx1 module intallation and imortaing and also we need extension of excel viewer.

        Name City  Age
0        Ram    A   12
1      Shyam    B   34
2  Ghanshyam    C   56

In [ ]:
# So far we read existing file and created then saved file in different format !
# Now we will see how to explore data in various process and ways ! Lets Go

### Data Exploration in Pandas:

In [ ]:
# Why we need to explore data! see following reasons !

# 1: To understand data set i.e to get idea idea about no of rows and columnns,their names and types of data types presents there.
# 2: To identifying problem and appprocohing their solution.
# 3: To get idea about missing data.

In [ ]:
# Head and Tail method..
# These methid gives idea about first and last n rows of data set to figure out orientation and clarity in data set.
# This methods will revieves only integer values as prameter.
# And remembers bades on numbers of passed integer as paraameter it gives no of firsta nd last row.
# If you doest pass any parameter as integer it will by default pass first/last  5 rows.
# Its also addups some brief data in first n rows and columns.

In [8]:


df = pd.read_csv(r"C:\Users\Pankaj Yadav\Downloads\sales_data_sample.csv", encoding = "latin1")


first_n_row = df.head(10)
last_n_row = df.tail(8)

print("First 10 rows of dataframe:\n",first_n_row)
print("Last 10 rows of dataframe:\n",last_n_row)

First 10 rows of dataframe:
    ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER    SALES  \
0        10107               30      95.70                2  2871.00
1        10121               34      81.35                5  2765.90
2        10134               41      94.74                2  3884.34
3        10145               45      83.26                6  3746.70
4        10159               49     100.00               14  5205.27
5        10168               36      96.66                1  3479.76
6        10180               29      86.13                9  2497.77
7        10188               48     100.00                1  5512.32
8        10201               22      98.57                2  2168.54
9        10211               41     100.00               14  4708.44

         ORDERDATE   STATUS  QTR_ID  MONTH_ID  YEAR_ID  ...  \
0   2/24/2003 0:00  Shipped       1         2     2003  ...
1    5/7/2003 0:00  Shipped       2         5     2003  ...
2    7/1/2003 0:00  Shipped       3         7     2003  ...
3   8/25/2003 0:00  Shipped       3         8     2003  ...
4  10/10/2003 0:00  Shipped       4        10     2003  ...
5  10/28/2003 0:00  Shipped       4        10     2003  ...
6  11/11/2003 0:00  Shipped       4        11     2003  ...
7  11/18/2003 0:00  Shipped       4        11     2003  ...
8   12/1/2003 0:00  Shipped       4        12     2003  ...
9   1/15/2004 0:00  Shipped       1         1     2004  ...

                    ADDRESSLINE1  ADDRESSLINE2           CITY STATE  \
0        897 Long Airport Avenue           NaN            NYC    NY
1             59 rue de l'Abbaye           NaN          Reims   NaN
2  27 rue du Colonel Pierre Avia           NaN          Paris   NaN
3             78934 Hillside Dr.           NaN       Pasadena    CA
4                7734 Strong St.           NaN  San Francisco    CA
5              9408 Furth Circle           NaN     Burlingame    CA
6        184, chausse de Tournai           NaN          Lille   NaN
7    Drammen 121, PR 744 Sentrum           NaN         Bergen   NaN
8      5557 North Pendale Street           NaN  San Francisco    CA
9              25, rue Lauriston           NaN          Paris   NaN

  POSTALCODE COUNTRY TERRITORY CONTACTLASTNAME CONTACTFIRSTNAME DEALSIZE
0      10022     USA       NaN              Yu             Kwai    Small
1      51100  France      EMEA         Henriot             Paul    Small
2      75508  France      EMEA        Da Cunha           Daniel   Medium
3      90003     USA       NaN           Young            Julie   Medium
4        NaN     USA       NaN           Brown            Julie   Medium
5      94217     USA       NaN          Hirano             Juri   Medium
6      59000  France      EMEA           Rance          Martine    Small
7     N 5804  Norway      EMEA          Oeztan           Veysel   Medium
8        NaN     USA       NaN          Murphy            Julie    Small
9      75016  France      EMEA         Perrier        Dominique   Medium

[10 rows x 25 columns]
Last 10 rows of dataframe:
       ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER    SALES  \
2815        10315               40      55.69                5  2227.60
2816        10327               37      86.74                4  3209.38
2817        10337               42      97.16                5  4080.72
2818        10350               20     100.00               15  2244.40
2819        10373               29     100.00                1  3978.51
2820        10386               43     100.00                4  5417.57
2821        10397               34      62.24                1  2116.16
2822        10414               47      65.52                9  3079.44

            ORDERDATE    STATUS  QTR_ID  MONTH_ID  YEAR_ID  ...  \
2815  10/29/2004 0:00   Shipped       4        10     2004  ...
2816  11/10/2004 0:00  Resolved       4        11     2004  ...
2817  11/21/2004 0:00   Shipped       4        11     2004  ...
2818   12/2/2004 0:00   Shipped       4        12     2004  ...
2819   1/31/2005 0:00   Shipped       1         1     2005  ...
2820    3/1/2005 0:00  Resolved       1         3     2005  ...
2821   3/28/2005 0:00   Shipped       1         3     2005  ...
2822    5/6/2005 0:00   On Hold       2         5     2005  ...

                      ADDRESSLINE1  ADDRESSLINE2       CITY STATE POSTALCODE  \
2815  67, rue des Cinquante Otages           NaN     Nantes   NaN      44000
2816                  Vinb'ltet 34           NaN  Kobenhavn   NaN       1734
2817              5905 Pompton St.     Suite 750        NYC    NY      10022
2818            C/ Moralzarzal, 86           NaN     Madrid   NaN      28034
2819                   Torikatu 38           NaN       Oulu   NaN      90110
2820            C/ Moralzarzal, 86           NaN     Madrid   NaN      28034
2821         1 rue Alsace-Lorraine           NaN   Toulouse   NaN      31000
2822            8616 Spinnaker Dr.           NaN     Boston    MA      51003

      COUNTRY TERRITORY CONTACTLASTNAME CONTACTFIRSTNAME DEALSIZE
2815   France      EMEA         Labrune           Janine    Small
2816  Denmark      EMEA        Petersen            Jytte   Medium
2817      USA       NaN       Hernandez            Maria   Medium
2818    Spain      EMEA          Freyre            Diego    Small
2819  Finland      EMEA       Koskitalo           Pirkko   Medium
2820    Spain      EMEA          Freyre            Diego   Medium
2821   France      EMEA          Roulet          Annette    Small
2822      USA       NaN         Yoshido             Juri   Medium

[8 rows x 25 columns]

In [ ]:
# Lets explore about data now
# Using info() method we will get holistic overview about the data(data frame)!  let see what it gives

# Counts no of rows and column.
# Columns name.
# Data types type
# Non null counts
# Memory usages of the data frame(i.e it is very useful so that we get idea about memory consumpsion dealing with large data set.)
# To get other infos as well.

# In simple words info()  gives summarize idea about the dataframe.

In [ ]:

data = {
    
    "Name" : ["Ram","Shyam","Ghanshyam"],
    "City" : ["A","B","C"],
    "Age"  : [12,34,56],
    "Sex"  : ["M","M","F"],
    "Section" : ["A","B","C"],
    "Group Code" :[3,5,9]

}

df = pd.DataFrame(data)

print(df.info())

#   lets see one more example bsaed on info method.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        3 non-null      object
 1   City        3 non-null      object
 2   Age         3 non-null      int64
 3   Sex         3 non-null      object
 4   Section     3 non-null      object
 5   Group Code  3 non-null      int64
dtypes: int64(2), object(4)
memory usage: 276.0+ bytes
None

#### Describe Method(): An powerful method/tool.

In [ ]:
# This describe method is very powerful tool/method of pandas used to give summmary of descriptave statistic  for numerical column in your dataframe , Donts worry iT is easy to get just be patient.
# Remember one thing this describe method deals with only numerical values (rows and columns of numrical values ), not to values of other data type.

# Its gives statistic calculation such as
# count, mean, standatrd deviation, min value,max value, 25%,50%,75% in each data set and this done in column wise.

In [ ]:

# Example 1 of Describe method:

data_employee = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eva", "Frank"],
    "Age": [25, 30, 22, 35, 28, 26],
    "City": ["New York", "Los Angeles", "Chicago", "Houston", "Phoenix", "Philadelphia"],
    "Salary": [50000, 60000, 45000, 70000, 52000, 58000],
    "Department": ["HR", "IT", "Finance", "Marketing", "Sales", "IT"],
    "Experience": [2, 5, 1, 7, 3, 4]
}

df = pd.DataFrame(data_employee)

# Using Describe Method:

Describe_method = df.describe()

print("Descriptive Statistic of Employees data:\n",Describe_method)

# Its summarise various statistic and numerical aspects regarding only numerical values in coloumn format.

# lets see one more example.

Descriptive Statistic of Data:
              Age        Salary  Experience
count   6.000000      6.000000    6.000000
mean   27.666667  55833.333333    3.666667
std     4.501851   8818.541074    2.160247
min    22.000000  45000.000000    1.000000
25%    25.250000  50500.000000    2.250000
50%    27.000000  55000.000000    3.500000
75%    29.500000  59500.000000    4.750000
max    35.000000  70000.000000    7.000000

In [5]:
# Example 2 of Describe method:

data_company = {
    "EmployeeID": [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    "Age": [25, 30, 22, 35, 28, 26, 31, 29, 33, 27],
    "Salary": [50000, 60000, 45000, 70000, 52000, 58000, 64000, 55000, 61000, 53000],
    "Experience": [2, 5, 1, 7, 3, 4, 6, 4, 5, 3],
    "Projects": [3, 8, 2, 10, 5, 6, 7, 4, 9, 5],
    "HoursWorkedPerWeek": [40, 45, 35, 50, 42, 44, 48, 41, 46, 43],
    "LeavesTaken": [2, 1, 3, 0, 2, 1, 1, 2, 0, 1],
    "Department": ["HR", "IT", "Finance", "Marketing", "Sales", "IT", "HR", "Marketing", "Sales", "Finance"],
    "City": ["New York", "Los Angeles", "Chicago", "Houston", "Phoenix", "Philadelphia", "San Diego", "Dallas", "Austin", "San Francisco"],
    "Gender": ["Female", "Male", "Female", "Male", "Female", "Male", "Female", "Male", "Female", "Male"],
    "Education": ["Bachelor's", "Master's", "Bachelor's", "MBA", "Bachelor's", "Master's", "PhD", "Bachelor's", "Master's", "MBA"],
    "PerformanceScore": [85, 90, 78, 92, 80, 88, 91, 84, 89, 87]
}

df2 = pd.DataFrame(data_company)
desc_method = df2.describe()

print("Descriptive statistic of employees data:\n", desc_method)

Descriptive statistic of employees data:
        EmployeeID        Age       Salary  Experience   Projects  \
count    10.00000  10.000000     10.00000   10.000000  10.000000
mean    105.50000  28.600000  56800.00000    4.000000   5.900000
std       3.02765   3.864367   7315.12892    1.825742   2.601282
min     101.00000  22.000000  45000.00000    1.000000   2.000000
25%     103.25000  26.250000  52250.00000    3.000000   4.250000
50%     105.50000  28.500000  56500.00000    4.000000   5.500000
75%     107.75000  30.750000  60750.00000    5.000000   7.750000
max     110.00000  35.000000  70000.00000    7.000000  10.000000

       HoursWorkedPerWeek  LeavesTaken  PerformanceScore
count           10.000000    10.000000          10.00000
mean            43.400000     1.300000          86.40000
std              4.273952     0.948683           4.64758
min             35.000000     0.000000          78.00000
25%             41.250000     1.000000          84.25000
50%             43.500000     1.000000          87.50000
75%             45.750000     2.000000          89.75000
max             50.000000     3.000000          92.00000

In [ ]:
# Now you task is to get aware about all aspect of that descriptive analysis of data set. What they really are  and explore about what is that 25%,50%,75%  and what is standard deviation and what are their practical usages in real world  environment.

#### Some Other Advanced Operation on dataset:

In [ ]:
# COLUMNS AND SHAPE property():

# 1: Shape() property gives the pairs of no of rows and no of columns(m,n).
# 2: Columns() property gives an index represneting the the columns name od data set.
# THEY BOTH ARE PROPERTY NOT METHODS THEY DONT TAKE ANY ARGUMENT LIKE METHODS

In [ ]:
data_x = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eva", "Frank"],
    "Age": [25, 30, 22, 35, 28, 26],
    "City": ["New York", "Los Angeles", "Chicago", "Houston", "Phoenix", "Philadelphia"],
    "Salary": [50000, 60000, 45000, 70000, 52000, 58000],
    "Department": ["HR", "IT", "Finance", "Marketing", "Sales", "IT"],
    "Experience": [2, 5, 1, 7, 3, 4]
}

df_x = pd.DataFrame(data_x)

shape_property = df_x.shape

columns_property = df_x.columns


print("Actual Dataframe :\n",df_x)
print("\nShape of our DataFrame:",shape_property)
print("\nColumns of our DataFrame:",  columns_property)




# .shape and .columns makes it easier to:

# 1: Understand the dataset quickly/Quick overview.

# 2: Identify issues like missing data initally so that that we can manipulate or fix that problem asap.

# 3: Data manipulation and feature engineering.

# 4: Quick overview of all columns name.

Actual Dataframe :
       Name  Age          City  Salary Department  Experience
0    Alice   25      New York   50000         HR           2
1      Bob   30   Los Angeles   60000         IT           5
2  Charlie   22       Chicago   45000    Finance           1
3    David   35       Houston   70000  Marketing           7
4      Eva   28       Phoenix   52000      Sales           3
5    Frank   26  Philadelphia   58000         IT           4

Shape of our DataFrame: (6, 6)

Columns of our DataFrame: Index(['Name', 'Age', 'City', 'Salary', 'Department', 'Experience'], dtype='object')

In [ ]:
# Whenevere we deals with data we must be aware of following things and figures.

# 1 : You should know to select specific columns to figure out details so that we can do data manipulation and data analysis and data modification.
# 2 : You should know how to filter rows based on cerain condition.

In [ ]:
# In Pandas if we wnat to perform following operation we nedds to do following steps.see

# 1 :  To Select specific columns = we may access it via using [] square bracket. we will do it now here
# 2 :  To filter rows we =  we may do it via using boolean condition.



# Now see what is selecting and filtering columns and how to do it. Before it we will see some facts.



#1 : Selecting columns returns you:; a: series(single column fo data) will it return if you want to accces single column of data.
#                                    b: Data frame of multiple column if you wish for multiple column data.


# 2: Filtering rows under some conditions ; we uses Boolean conditions here.

# lets goooooooooooo on next cell.


data_company = {
    "EmployeeID": [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    "Age": [25, 30, 22, 35, 28, 26, 31, 29, 33, 27],
    "Salary": [50000, 60000, 45000, 70000, 52000, 58000, 64000, 55000, 61000, 53000],
    "Experience": [2, 5, 1, 7, 3, 4, 6, 4, 5, 3],
    "Projects": [3, 8, 2, 10, 5, 6, 7, 4, 9, 5],
    "HoursWorkedPerWeek": [40, 45, 35, 50, 42, 44, 48, 41, 46, 43],
    "LeavesTaken": [2, 1, 3, 0, 2, 1, 1, 2, 0, 1],
    "Department": ["HR", "IT", "Finance", "Marketing", "Sales", "IT", "HR", "Marketing", "Sales", "Finance"],
    "City": ["New York", "Los Angeles", "Chicago", "Houston", "Phoenix", "Philadelphia", "San Diego", "Dallas", "Austin", "San Francisco"],
    "Gender": ["Female", "Male", "Female", "Male", "Female", "Male", "Female", "Male", "Female", "Male"],
    "Education": ["Bachelor's", "Master's", "Bachelor's", "MBA", "Bachelor's", "Master's", "PhD", "Bachelor's", "Master's", "MBA"],
    "PerformanceScore": [85, 90, 78, 92, 80, 88, 91, 84, 89, 87]
}


df = pd.DataFrame(data_company)
#print("Complete DataFrame:\n\n",df)

In [ ]:

data_company = {
    "EmployeeID": [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    "Age": [25, 30, 22, 35, 28, 26, 31, 29, 33, 27],
    "Salary": [50000, 60000, 45000, 70000, 52000, 58000, 64000, 55000, 61000, 53000],
    "Experience": [2, 5, 1, 7, 3, 4, 6, 4, 5, 3],
    "Projects": [3, 8, 2, 10, 5, 6, 7, 4, 9, 5],
    "HoursWorkedPerWeek": [40, 45, 35, 50, 42, 44, 48, 41, 46, 43],
    "LeavesTaken": [2, 1, 3, 0, 2, 1, 1, 2, 0, 1],
    "Department": ["HR", "IT", "Finance", "Marketing", "Sales", "IT", "HR", "Marketing", "Sales", "Finance"],
    "City": ["New York", "Los Angeles", "Chicago", "Houston", "Phoenix", "Philadelphia", "San Diego", "Dallas", "Austin", "San Francisco"],
    "Gender": ["Female", "Male", "Female", "Male", "Female", "Male", "Female", "Male", "Female", "Male"],
    "Education": ["Bachelor's", "Master's", "Bachelor's", "MBA", "Bachelor's", "Master's", "PhD", "Bachelor's", "Master's", "MBA"],
    "PerformanceScore": [85, 90, 78, 92, 80, 88, 91, 84, 89, 87]
}

df = pd.DataFrame(data_company)


# filtering  single columns : Grab the syntax carefully.


column_a = df['Projects']  # To acces use single commas only ' ' not "" okay ! here 
print("Data of project column;\n\n",column_a)

column_b = df['Education']
print("\nData of Education's column\n\n",column_b)

Data of project column;

 0     3
1     8
2     2
3    10
4     5
5     6
6     7
7     4
8     9
9     5
Name: Projects, dtype: int64

Data of Education's column

 0    Bachelor's
1      Master's
2    Bachelor's
3           MBA
4    Bachelor's
5      Master's
6           PhD
7    Bachelor's
8      Master's
9           MBA
Name: Education, dtype: object

In [ ]:
# Filtering multiple columns : Whenever you are trying to acces more than one column make sure to use 2 square bracket.and rest synatx is saame and just put column name in single closed aphostrophy ' ' okay. So observe synatx carefully.


data_company = {
    "EmployeeID": [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    "Age": [25, 30, 22, 35, 28, 26, 31, 29, 33, 27],
    "Salary": [50000, 60000, 45000, 70000, 52000, 58000, 64000, 55000, 61000, 53000],
    "Experience": [2, 5, 1, 7, 3, 4, 6, 4, 5, 3],
    "Projects": [3, 8, 2, 10, 5, 6, 7, 4, 9, 5],
    "HoursWorkedPerWeek": [40, 45, 35, 50, 42, 44, 48, 41, 46, 43],
    "LeavesTaken": [2, 1, 3, 0, 2, 1, 1, 2, 0, 1],
    "Department": ["HR", "IT", "Finance", "Marketing", "Sales", "IT", "HR", "Marketing", "Sales", "Finance"],
    "City": ["New York", "Los Angeles", "Chicago", "Houston", "Phoenix", "Philadelphia", "San Diego", "Dallas", "Austin", "San Francisco"],
    "Gender": ["Female", "Male", "Female", "Male", "Female", "Male", "Female", "Male", "Female", "Male"],
    "Education": ["Bachelor's", "Master's", "Bachelor's", "MBA", "Bachelor's", "Master's", "PhD", "Bachelor's", "Master's", "MBA"],
    "PerformanceScore": [85, 90, 78, 92, 80, 88, 91, 84, 89, 87]
}

df = pd.DataFrame(data_company)

multiplecol_a = df[['Gender','Department']]

print("Accessing Multiple Columns:\n\n",multiplecol_a)




multiplecol_b = df[['Gender','Education','Age']]

print("\n\nAccesing multiple column:\n\n",multiplecol_b)


multiplecol_c = df[['HoursWorkedPerWeek','Experience','EmployeeID','PerformanceScore']]

print("\n\nAccessing multiple columns:\n\n",multiplecol_c)


# Bas thoda syntax format se aware rehna okay!

Accessing Multiple Columns:

    Gender Department
0  Female         HR
1    Male         IT
2  Female    Finance
3    Male  Marketing
4  Female      Sales
5    Male         IT
6  Female         HR
7    Male  Marketing
8  Female      Sales
9    Male    Finance


Accesing multiple column:

    Gender   Education  Age
0  Female  Bachelor's   25
1    Male    Master's   30
2  Female  Bachelor's   22
3    Male         MBA   35
4  Female  Bachelor's   28
5    Male    Master's   26
6  Female         PhD   31
7    Male  Bachelor's   29
8  Female    Master's   33
9    Male         MBA   27


Accessing multiple columns:

    HoursWorkedPerWeek  Experience  EmployeeID  PerformanceScore
0                  40           2         101                85
1                  45           5         102                90
2                  35           1         103                78
3                  50           7         104                92
4                  42           3         105                80
5                  44           4         106                88
6                  48           6         107                91
7                  41           4         108                84
8                  46           5         109                89
9                  43           3         110                87

In [ ]:
# Now we will access that rows with conditions. Lets go!


data_company = {

    "EmployeeID": [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    "Age": [25, 30, 22, 35, 28, 26, 31, 29, 33, 27],
    "Salary": [50000, 60000, 45000, 70000, 52000, 58000, 64000, 55000, 61000, 53000],
    "Experience": [2, 5, 1, 7, 3, 4, 6, 4, 5, 3],
    "Projects": [3, 8, 2, 10, 5, 6, 7, 4, 9, 5],
    "HoursWorkedPerWeek": [40, 45, 35, 50, 42, 44, 48, 41, 46, 43],
    "LeavesTaken": [2, 1, 3, 0, 2, 1, 1, 2, 0, 1],
    "Department": ["HR", "IT", "Finance", "Marketing", "Sales", "IT", "HR", "Marketing", "Sales", "Finance"],
    "City": ["New York", "Los Angeles", "Chicago", "Houston", "Phoenix", "Philadelphia", "San Diego", "Dallas", "Austin", "San Francisco"],
    "Gender": ["Female", "Male", "Female", "Male", "Female", "Male", "Female", "Male", "Female", "Male"],
    "Education": ["Bachelor's", "Master's", "Bachelor's", "MBA", "Bachelor's", "Master's", "PhD", "Bachelor's", "Master's", "MBA"],
    "PerformanceScore": [85, 90, 78, 92, 80, 88, 91, 84, 89, 87]
}

df = pd.DataFrame(data_company)


# Lets Accessing Rows with single condition: see syntax carefully.

filtered_row1 = df[df['Age'] > 27]
print("Single conditioned filtered row:\n\n",filtered_row1)

 # Its willl return all those columns data where in row age is > 27.lets see one more case.

filtered_row2 = df[df['PerformanceScore']<85]
print("\n Single Conditioned fileterd row:\n\n", filtered_row2)

 # Its willl return all those columns data where in row where performancescore is < 27.lets see one more case.

Single conditioned filtered row:

    EmployeeID  Age  Salary  Experience  Projects  HoursWorkedPerWeek  \
1         102   30   60000           5         8                  45
3         104   35   70000           7        10                  50
4         105   28   52000           3         5                  42
6         107   31   64000           6         7                  48
7         108   29   55000           4         4                  41
8         109   33   61000           5         9                  46

   LeavesTaken Department         City  Gender   Education  PerformanceScore
1            1         IT  Los Angeles    Male    Master's                90
3            0  Marketing      Houston    Male         MBA                92
4            2      Sales      Phoenix  Female  Bachelor's                80
6            1         HR    San Diego  Female         PhD                91
7            2  Marketing       Dallas    Male  Bachelor's                84
8            0      Sales       Austin  Female    Master's                89

 Single Conditioned fileterd row:

    EmployeeID  Age  Salary  Experience  Projects  HoursWorkedPerWeek  \
2         103   22   45000           1         2                  35
4         105   28   52000           3         5                  42
7         108   29   55000           4         4                  41

   LeavesTaken Department     City  Gender   Education  PerformanceScore
2            3    Finance  Chicago  Female  Bachelor's                78
4            2      Sales  Phoenix  Female  Bachelor's                80
7            2  Marketing   Dallas    Male  Bachelor's                84

In [12]:

data_company = {

    "EmployeeID": [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    "Age": [25, 30, 22, 35, 28, 26, 31, 29, 33, 27],
    "Salary": [50000, 60000, 45000, 70000, 52000, 58000, 64000, 55000, 61000, 53000],
    "Experience": [2, 5, 1, 7, 3, 4, 6, 4, 5, 3],
    "Projects": [3, 8, 2, 10, 5, 6, 7, 4, 9, 5],
    "HoursWorkedPerWeek": [40, 45, 35, 50, 42, 44, 48, 41, 46, 43],
    "LeavesTaken": [2, 1, 3, 0, 2, 1, 1, 2, 0, 1],
    "Department": ["HR", "IT", "Finance", "Marketing", "Sales", "IT", "HR", "Marketing", "Sales", "Finance"],
    "City": ["New York", "Los Angeles", "Chicago", "Houston", "Phoenix", "Philadelphia", "San Diego", "Dallas", "Austin", "San Francisco"],
    "Gender": ["Female", "Male", "Female", "Male", "Female", "Male", "Female", "Male", "Female", "Male"],
    "Education": ["Bachelor's", "Master's", "Bachelor's", "MBA", "Bachelor's", "Master's", "PhD", "Bachelor's", "Master's", "MBA"],
    "PerformanceScore": [85, 90, 78, 92, 80, 88, 91, 84, 89, 87]
}

df = pd.DataFrame(data_company)






# Filetering rows with multiple condition. grab syntax carefull here insted of using 2 square bracket we use one [] and within it one () bracket where we specify conditions within single close aphostrophy.

#You can combine multiple conditions using:

# 1:  & (AND)  both conditions must be true.

# 2:| (OR)  at least one condition must be true.

# 3: ~ (NOT)  to negate a condition. lets see!

# Here syntax is somewhat complex so we comfortable with it! via intense practice.

# with (&) condition.

filtered_row_a = df[(df['Salary']>65000) & (df['Gender'] == "Male")]
print("Accesing row with multiple  with(&):\n\n",filtered_row_a)


# with OR(|) condition.

filtered_row_b = df[(df['Experience']> 5) |(df['PerformanceScore']<85)]
print("\n\nAccesing row with myltiple conditions with(OR) :\n\n",filtered_row_b)



# with Not(~) condition.

filtered_row_c = df[~(df['Gender'] == "Female")]
fileterd_row_d = df[~(df['Salary']>70000)]


print("\n\nFiletering rows with multiple condition with(NOT):\n\n",filtered_row_c)
print("\n\nFiletering rows with multiple condition with(NOT):\n\n",fileterd_row_d)

Accesing row with multiple  with(&):

    EmployeeID  Age  Salary  Experience  Projects  HoursWorkedPerWeek  \
3         104   35   70000           7        10                  50

   LeavesTaken Department     City Gender Education  PerformanceScore
3            0  Marketing  Houston   Male       MBA                92


Accesing row with myltiple conditions with(OR) :

    EmployeeID  Age  Salary  Experience  Projects  HoursWorkedPerWeek  \
2         103   22   45000           1         2                  35
3         104   35   70000           7        10                  50
4         105   28   52000           3         5                  42
6         107   31   64000           6         7                  48
7         108   29   55000           4         4                  41

   LeavesTaken Department       City  Gender   Education  PerformanceScore
2            3    Finance    Chicago  Female  Bachelor's                78
3            0  Marketing    Houston    Male         MBA                92
4            2      Sales    Phoenix  Female  Bachelor's                80
6            1         HR  San Diego  Female         PhD                91
7            2  Marketing     Dallas    Male  Bachelor's                84


Filetering rows with multiple condition with(NOT):

    EmployeeID  Age  Salary  Experience  Projects  HoursWorkedPerWeek  \
1         102   30   60000           5         8                  45
3         104   35   70000           7        10                  50
5         106   26   58000           4         6                  44
7         108   29   55000           4         4                  41
9         110   27   53000           3         5                  43

   LeavesTaken Department           City Gender   Education  PerformanceScore
1            1         IT    Los Angeles   Male    Master's                90
3            0  Marketing        Houston   Male         MBA                92
5            1         IT   Philadelphia   Male    Master's                88
7            2  Marketing         Dallas   Male  Bachelor's                84
9            1    Finance  San Francisco   Male         MBA                87


Filetering rows with multiple condition with(NOT):

    EmployeeID  Age  Salary  Experience  Projects  HoursWorkedPerWeek  \
0         101   25   50000           2         3                  40
1         102   30   60000           5         8                  45
2         103   22   45000           1         2                  35
3         104   35   70000           7        10                  50
4         105   28   52000           3         5                  42
5         106   26   58000           4         6                  44
6         107   31   64000           6         7                  48
7         108   29   55000           4         4                  41
8         109   33   61000           5         9                  46
9         110   27   53000           3         5                  43

   LeavesTaken Department           City  Gender   Education  PerformanceScore
0            2         HR       New York  Female  Bachelor's                85
1            1         IT    Los Angeles    Male    Master's                90
2            3    Finance        Chicago  Female  Bachelor's                78
3            0  Marketing        Houston    Male         MBA                92
4            2      Sales        Phoenix  Female  Bachelor's                80
5            1         IT   Philadelphia    Male    Master's                88
6            1         HR      San Diego  Female         PhD                91
7            2  Marketing         Dallas    Male  Bachelor's                84
8            0      Sales         Austin  Female    Master's                89
9            1    Finance  San Francisco    Male         MBA                87